УчетВУправляющихДляГит1/src/Catalogs/КлассификаторВидовПредпринимательскойДеятельностиПСН/КлассификаторВидовПредпринимательскойДеятельностиПСН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КлассификаторВидовПредпринимательскойДеятельностиПСН</name>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоходНеЗависитОтКоличестваСотрудников</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодТипаТС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоВодныйТранспорт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоПеревозкаГрузов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоПеревозкаПассажиров</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УказатьОбъекты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

УчетВУправляющихДляГит1/src/Catalogs/КлассификаторВидовПредпринимательскойДеятельностиПСН/Forms/ФормаВыгрузкиКлассификатора/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Классификатор.Код КАК Код,
	|	Классификатор.Наименование КАК Наименование,
	|	Классификатор.НаименованиеПолное КАК НаименованиеПолное,
	|	Классификатор.ДоходНеЗависитОтКоличестваСотрудников КАК ДоходНеЗависитОтКоличестваСотрудников,
	|	Классификатор.КодТипаТС КАК КодТипаТС,
	|	Классификатор.ЭтоВодныйТранспорт КАК ЭтоВодныйТранспорт,
	|	Классификатор.ЭтоПеревозкаГрузов КАК ЭтоПеревозкаГрузов,
	|	Классификатор.ЭтоПеревозкаПассажиров КАК ЭтоПеревозкаПассажиров,
	|	Классификатор.УказатьОбъекты КАК УказатьОбъекты
	|ИЗ
	|	Справочник.КлассификаторВидовПредпринимательскойДеятельностиПСН КАК Классификатор
	|
	|УПОРЯДОЧИТЬ ПО
	|	Классификатор.Код");
	
	ТаблицаДанных = Запрос.Выполнить().Выгрузить();
	СтрокаXML = ОбщегоНазначения.ЗначениеВСтрокуXML(ТаблицаДанных);
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.УстановитьТекст(СтрокаXML);
	
КонецПроцедуры

#КонецОбласти
